[
    {
        "Duplicate": [
            {
                "Название": "Samsung Q80T",
                "Тип панели": "QLED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Tizen"
            },
            {
                "Название": "Samsung Q80T",
                "Тип панели": "QLED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Tizen"
            },
            {
                "Название": "Samsung RU7100",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "Tizen"
            }
        ]
    },
    {
        "Duplicate": [
            {
                "Название": "LG CX",
                "Тип панели": "OLED",
                "Диагональ (дюйм)": "65",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "webOS"
            },
            {
                "Название": "LG CX",
                "Тип панели": "OLED",
                "Диагональ (дюйм)": "65",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "webOS"
            },
            {
                "Название": "LG NanoCell 85 Series",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "65",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "webOS"
            }
        ]
    },
    {
        "Duplicate": [
            {
                "Название": "Sony X900H",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "75",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Android TV"
            },
            {
                "Название": "Hisense H9G",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Android TV"
            },
            {
                "Название": "Sony X900H",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "75",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Android TV"
            },
            {
                "Название": "Hisense H9G",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Android TV"
            },
            {
                "Название": "Sony A8H",
                "Тип панели": "OLED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Android TV"
            }
        ]
    },
    {
        "Duplicate": [
            {
                "Название": "TCL 6-Series",
                "Тип панели": "QLED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "Roku TV"
            },
            {
                "Название": "TCL 6-Series",
                "Тип панели": "QLED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "Roku TV"
            },
            {
                "Название": "TCL 5-Series",
                "Тип панели": "QLED",
                "Диагональ (дюйм)": "50",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "Roku TV"
            }
        ]
    },
    {
        "Duplicate": [
            {
                "Название": "Vizio P-Series",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "65",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "SmartCast"
            },
            {
                "Название": "Vizio P-Series",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "65",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "SmartCast"
            },
            {
                "Название": "Vizio M-Series Quantum",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "65",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "SmartCast"
            }
        ]
    },
    {
        "Duplicate": [
            {
                "Название": "Panasonic HX800",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "58",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "My Home Screen"
            },
            {
                "Название": "Panasonic HX800",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "58",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "My Home Screen"
            },
            {
                "Название": "Panasonic GX800",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "58",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "My Home Screen"
            }
        ]
    },
    {
        "Duplicate": [
            {
                "Название": "Philips OLED805",
                "Тип панели": "OLED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Android TV"
            },
            {
                "Название": "Hisense H9G",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Android TV"
            },
            {
                "Название": "Philips OLED805",
                "Тип панели": "OLED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Android TV"
            },
            {
                "Название": "Sony A8H",
                "Тип панели": "OLED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "120",
                "Операционная система": "Android TV"
            }
        ]
    },
    {
        "Duplicate": [
            {
                "Название": "Sharp Aquos",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "70",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "SmartCentral"
            },
            {
                "Название": "Sharp Aquos",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "70",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "SmartCentral"
            },
            {
                "Название": "Sharp LC-50N7000U",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "50",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "SmartCentral"
            }
        ]
    },
    {
        "Duplicate": [
            {
                "Название": "JVC Fire TV Edition",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "50",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "Fire OS"
            },
            {
                "Название": "JVC Fire TV Edition",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "50",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "Fire OS"
            }
        ]
    },
    {
        "Duplicate": [
            {
                "Название": "Hisense H8G",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "55",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "Android TV"
            },
            {
                "Название": "Philips PUS7304",
                "Тип панели": "LED",
                "Диагональ (дюйм)": "50",
                "Разрешение": "4K",
                "Поддержка hdr": "True",
                "Частота (гц)": "60",
                "Операционная система": "Android TV"
            }
        ]
    }
]