[
    {
        "Название": "Samsung Q80T",
        "Тип панели": "QLED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "Tizen"
    },
    {
        "Название": "LG CX",
        "Тип панели": "OLED",
        "Диагональ (дюйм)": "65",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "webOS"
    },
    {
        "Название": "Sony X900H",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "75",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "Android TV"
    },
    {
        "Название": "TCL 6-Series",
        "Тип панели": "QLED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "Roku TV"
    },
    {
        "Название": "Vizio P-Series",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "65",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "SmartCast"
    },
    {
        "Название": "Hisense H9G",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "Android TV"
    },
    {
        "Название": "Panasonic HX800",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "58",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "My Home Screen"
    },
    {
        "Название": "Philips OLED805",
        "Тип панели": "OLED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "Android TV"
    },
    {
        "Название": "Sharp Aquos",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "70",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "SmartCentral"
    },
    {
        "Название": "JVC Fire TV Edition",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "50",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "Fire OS"
    },
    {
        "Название": "Samsung Q80T",
        "Тип панели": "QLED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "Tizen"
    },
    {
        "Название": "LG CX",
        "Тип панели": "OLED",
        "Диагональ (дюйм)": "65",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "webOS"
    },
    {
        "Название": "Sony X900H",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "75",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "Android TV"
    },
    {
        "Название": "TCL 6-Series",
        "Тип панели": "QLED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "Roku TV"
    },
    {
        "Название": "Vizio P-Series",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "65",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "SmartCast"
    },
    {
        "Название": "Hisense H9G",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "Android TV"
    },
    {
        "Название": "Panasonic HX800",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "58",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "My Home Screen"
    },
    {
        "Название": "Philips OLED805",
        "Тип панели": "OLED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "Android TV"
    },
    {
        "Название": "Sharp Aquos",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "70",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "SmartCentral"
    },
    {
        "Название": "JVC Fire TV Edition",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "50",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "Fire OS"
    },
    {
        "Название": "Samsung RU7100",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "Tizen"
    },
    {
        "Название": "LG NanoCell 85 Series",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "65",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "webOS"
    },
    {
        "Название": "Sony A8H",
        "Тип панели": "OLED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "120",
        "Операционная система": "Android TV"
    },
    {
        "Название": "TCL 5-Series",
        "Тип панели": "QLED",
        "Диагональ (дюйм)": "50",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "Roku TV"
    },
    {
        "Название": "Vizio M-Series Quantum",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "65",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "SmartCast"
    },
    {
        "Название": "Hisense H8G",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "55",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "Android TV"
    },
    {
        "Название": "Panasonic GX800",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "58",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "My Home Screen"
    },
    {
        "Название": "Philips PUS7304",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "50",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "Android TV"
    },
    {
        "Название": "Sharp LC-50N7000U",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "50",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "SmartCentral"
    },
    {
        "Название": "JVC LT-43MAW595",
        "Тип панели": "LED",
        "Диагональ (дюйм)": "43",
        "Разрешение": "4K",
        "Поддержка hdr": "True",
        "Частота (гц)": "60",
        "Операционная система": "Roku TV"
    }
]